In [1]:
import pandas as pd

In [2]:
friend_list = [{'name':'jone','age':20, 'sex':'m'},{'name':'alex','age':30,'sex':'m'},
               {'name':'jenny','age':25, "sex":'f'}
              ]

In [3]:
friend_list

[{'name': 'jone', 'age': 20, 'sex': 'm'},
 {'name': 'alex', 'age': 30, 'sex': 'm'},
 {'name': 'jenny', 'age': 25, 'sex': 'f'}]

In [4]:
df = pd.DataFrame(friend_list)

In [5]:
df

    name  age sex
0   jone   20   m
1   alex   30   m
2  jenny   25   f

In [7]:
df.head(2)

   name  age sex
0  jone   20   m
1  alex   30   m

In [8]:
df = df[['age','sex','name']]

In [9]:
df

   age sex   name
0   20   m   jone
1   30   m   alex
2   25   f  jenny

In [10]:
friend_list = [ ['John', 20, 'student'],['Jenny', 30, 'developer'],['Nate', 30, 'teacher'] ]

In [11]:
column_name = ['name', 'age', 'job']

In [12]:
df = pd.DataFrame.from_records(friend_list, columns=column_name)

In [13]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher